In [1]:
import pandas as pd
df=pd.DataFrame([{'year':'2015-2016','3PA':11.1 ,'3PM': 5.1}])

In [2]:
df

    3PA  3PM       year
0  11.1  5.1  2015-2016

In [3]:
df2=pd.DataFrame({'3PA':[8.1,7.8,3.2],
                  '3PM':[3.6,3.3,3.5],
                  'year':['2014-2015','2013-2014','2012-2013']
                 })

In [4]:
df2

   3PA  3PM       year
0  8.1  3.6  2014-2015
1  7.8  3.3  2013-2014
2  3.2  3.5  2012-2013

In [6]:
df3 = pd.concat([df,df2],ignore_index = True)

In [7]:
df3

    3PA  3PM       year
0  11.1  5.1  2015-2016
1   8.1  3.6  2014-2015
2   7.8  3.3  2013-2014
3   3.2  3.5  2012-2013

In [8]:
df3.iloc[3] = [4.7 , 2.2 , '2011-2012']

In [9]:
df3

    3PA  3PM       year
0  11.1  5.1  2015-2016
1   8.1  3.6  2014-2015
2   7.8  3.3  2013-2014
3   4.7  2.2  2011-2012

In [12]:
json_data=' {"3PA":{"0":11.1,"1":8.1,"2":5.4,"3":6.2,"4":4.7}}'

In [13]:
df = pd.read_json(json_data)

In [14]:
df

    3PA
0  11.1
1   8.1
2   5.4
3   6.2
4   4.7

In [15]:
df['3PM']=[1.2,4.3,11.1,3.7,8.5]

In [19]:
df['year']=['2016-15','2015-14','2014-13','2013-12','2012-11']

In [20]:
df

    3PA   3PM     year
0  11.1   1.2  2016-15
1   8.1   4.3  2015-14
2   5.4  11.1  2014-13
3   6.2   3.7  2013-12
4   4.7   8.5  2012-11

In [21]:
df['PTS'] = [12.1,23.1,15.6,25.5,32]

In [22]:
df

    3PA   3PM     year   PTS
0  11.1   1.2  2016-15  12.1
1   8.1   4.3  2015-14  23.1
2   5.4  11.1  2014-13  15.6
3   6.2   3.7  2013-12  25.5
4   4.7   8.5  2012-11  32.0

In [23]:
df['Team']='Golden state'

In [24]:
df

    3PA   3PM     year   PTS          Team
0  11.1   1.2  2016-15  12.1  Golden state
1   8.1   4.3  2015-14  23.1  Golden state
2   5.4  11.1  2014-13  15.6  Golden state
3   6.2   3.7  2013-12  25.5  Golden state
4   4.7   8.5  2012-11  32.0  Golden state

In [25]:
df.loc[:,"League"]='NBA'

In [26]:
df

    3PA   3PM     year   PTS          Team League
0  11.1   1.2  2016-15  12.1  Golden state    NBA
1   8.1   4.3  2015-14  23.1  Golden state    NBA
2   5.4  11.1  2014-13  15.6  Golden state    NBA
3   6.2   3.7  2013-12  25.5  Golden state    NBA
4   4.7   8.5  2012-11  32.0  Golden state    NBA

In [30]:
(df['3PM']/df['3PA'])*100

0     10.810811
1     53.086420
2    205.555556
3     59.677419
4    180.851064
dtype: float64

In [32]:
def percent(vals):
    made,attempt = vals
    return made/attempt * 100

In [36]:
df[['3PM','3PA']].apply(percent,axis=1)

0     10.810811
1     53.086420
2    205.555556
3     59.677419
4    180.851064
dtype: float64

In [37]:
df['3PP'] = df[['3PM','3PA']].apply(percent,axis=1)

In [38]:
df

    3PA   3PM     year   PTS          Team League         3PP
0  11.1   1.2  2016-15  12.1  Golden state    NBA   10.810811
1   8.1   4.3  2015-14  23.1  Golden state    NBA   53.086420
2   5.4  11.1  2014-13  15.6  Golden state    NBA  205.555556
3   6.2   3.7  2013-12  25.5  Golden state    NBA   59.677419
4   4.7   8.5  2012-11  32.0  Golden state    NBA  180.851064

In [39]:
df['3PP'].apply(lambda x : x/100)

0    0.108108
1    0.530864
2    2.055556
3    0.596774
4    1.808511
Name: 3PP, dtype: float64

In [40]:
df.pop('Team')

0    Golden state
1    Golden state
2    Golden state
3    Golden state
4    Golden state
Name: Team, dtype: object

In [41]:
df

    3PA   3PM     year   PTS League         3PP
0  11.1   1.2  2016-15  12.1    NBA   10.810811
1   8.1   4.3  2015-14  23.1    NBA   53.086420
2   5.4  11.1  2014-13  15.6    NBA  205.555556
3   6.2   3.7  2013-12  25.5    NBA   59.677419
4   4.7   8.5  2012-11  32.0    NBA  180.851064

In [42]:
df.rename(columns = {'3PA':'3 Points attempted'})

   3 Points attempted   3PM     year   PTS League         3PP
0                11.1   1.2  2016-15  12.1    NBA   10.810811
1                 8.1   4.3  2015-14  23.1    NBA   53.086420
2                 5.4  11.1  2014-13  15.6    NBA  205.555556
3                 6.2   3.7  2013-12  25.5    NBA   59.677419
4                 4.7   8.5  2012-11  32.0    NBA  180.851064

In [43]:
df.set_value(5,'year','2017-16')

    3PA   3PM     year   PTS League         3PP
0  11.1   1.2  2016-15  12.1    NBA   10.810811
1   8.1   4.3  2015-14  23.1    NBA   53.086420
2   5.4  11.1  2014-13  15.6    NBA  205.555556
3   6.2   3.7  2013-12  25.5    NBA   59.677419
4   4.7   8.5  2012-11  32.0    NBA  180.851064
5   NaN   NaN  2017-16   NaN    NaN         NaN

In [46]:
df.sort_values('year', ascending=False)

    3PA   3PM     year   PTS League         3PP
5   NaN   NaN  2017-16   NaN    NaN         NaN
0  11.1   1.2  2016-15  12.1    NBA   10.810811
1   8.1   4.3  2015-14  23.1    NBA   53.086420
2   5.4  11.1  2014-13  15.6    NBA  205.555556
3   6.2   3.7  2013-12  25.5    NBA   59.677419
4   4.7   8.5  2012-11  32.0    NBA  180.851064

In [47]:
df.sort_values('PTS', na_position ='first')

    3PA   3PM     year   PTS League         3PP
5   NaN   NaN  2017-16   NaN    NaN         NaN
0  11.1   1.2  2016-15  12.1    NBA   10.810811
2   5.4  11.1  2014-13  15.6    NBA  205.555556
1   8.1   4.3  2015-14  23.1    NBA   53.086420
3   6.2   3.7  2013-12  25.5    NBA   59.677419
4   4.7   8.5  2012-11  32.0    NBA  180.851064

In [54]:
df.sort_values('PTS')
df['GP'] = [25, 80, 35, 70, 70 ,None]

In [55]:
df

    3PA   3PM     year   PTS League         3PP    GP
0  11.1   1.2  2016-15  12.1    NBA   10.810811  25.0
1   8.1   4.3  2015-14  23.1    NBA   53.086420  80.0
2   5.4  11.1  2014-13  15.6    NBA  205.555556  35.0
3   6.2   3.7  2013-12  25.5    NBA   59.677419  70.0
4   4.7   8.5  2012-11  32.0    NBA  180.851064  70.0
5   NaN   NaN  2017-16   NaN    NaN         NaN   NaN

In [57]:
df.sort_values(['GP','PTS'],ascending=[True,False])

    3PA   3PM     year   PTS League         3PP    GP
0  11.1   1.2  2016-15  12.1    NBA   10.810811  25.0
2   5.4  11.1  2014-13  15.6    NBA  205.555556  35.0
4   4.7   8.5  2012-11  32.0    NBA  180.851064  70.0
3   6.2   3.7  2013-12  25.5    NBA   59.677419  70.0
1   8.1   4.3  2015-14  23.1    NBA   53.086420  80.0
5   NaN   NaN  2017-16   NaN    NaN         NaN   NaN

In [59]:
df.sort_index(ascending = False)

    3PA   3PM     year   PTS League         3PP    GP
5   NaN   NaN  2017-16   NaN    NaN         NaN   NaN
4   4.7   8.5  2012-11  32.0    NBA  180.851064  70.0
3   6.2   3.7  2013-12  25.5    NBA   59.677419  70.0
2   5.4  11.1  2014-13  15.6    NBA  205.555556  35.0
1   8.1   4.3  2015-14  23.1    NBA   53.086420  80.0
0  11.1   1.2  2016-15  12.1    NBA   10.810811  25.0

# Iteration of Dataframes

In [60]:
for thing in df:
    print(thing , type(thing))
    break

3PA <class 'str'>

In [61]:
for col_name in df:
    print(col_name)

3PA
3PM
year
PTS
League
3PP
GP

In [63]:
list(df)

['3PA', '3PM', 'year', 'PTS', 'League', '3PP', 'GP']

In [65]:
for thing in df.iteritems():
    print(thing)
    break

('3PA', 0    11.1
1     8.1
2     5.4
3     6.2
4     4.7
5     NaN
Name: 3PA, dtype: float64)

In [67]:
for name,col in df.iteritems():
    print(name,col)
    break

3PA 0    11.1
1     8.1
2     5.4
3     6.2
4     4.7
5     NaN
Name: 3PA, dtype: float64

In [69]:
for tup in df.itertuples():
    print(tup)
    break

Pandas(Index=0, _1=11.1, _2=1.2, year='2016-15', PTS=12.1, League='NBA', _6=10.810810810810811, GP=25.0)

In [71]:
for thing in df.iterrows():
    print(thing , type(thing))
    break

(0, 3PA          11.1
3PM           1.2
year      2016-15
PTS          12.1
League        NBA
3PP       10.8108
GP             25
Name: 0, dtype: object) <class 'tuple'>

In [72]:
for idx,row in df.iterrows():
    print(idx , row)
    break

0 3PA          11.1
3PM           1.2
year      2016-15
PTS          12.1
League        NBA
3PP       10.8108
GP             25
Name: 0, dtype: object

# Setting data

In [73]:
df = df.set_index('year')

In [74]:
df

          3PA   3PM   PTS League         3PP    GP
year
2016-15  11.1   1.2  12.1    NBA   10.810811  25.0
2015-14   8.1   4.3  23.1    NBA   53.086420  80.0
2014-13   5.4  11.1  15.6    NBA  205.555556  35.0
2013-12   6.2   3.7  25.5    NBA   59.677419  70.0
2012-11   4.7   8.5  32.0    NBA  180.851064  70.0
2017-16   NaN   NaN   NaN    NaN         NaN   NaN

In [75]:
df.set_value('2017-16','Team','Jazz')

          3PA   3PM   PTS League         3PP    GP  Team
year
2016-15  11.1   1.2  12.1    NBA   10.810811  25.0   NaN
2015-14   8.1   4.3  23.1    NBA   53.086420  80.0   NaN
2014-13   5.4  11.1  15.6    NBA  205.555556  35.0   NaN
2013-12   6.2   3.7  25.5    NBA   59.677419  70.0   NaN
2012-11   4.7   8.5  32.0    NBA  180.851064  70.0   NaN
2017-16   NaN   NaN   NaN    NaN         NaN   NaN  Jazz

In [83]:
df.iloc[5,3]='NBA'

In [84]:
df

          3PA   3PM   PTS League         3PP    GP  Team
year
2016-15  11.1   1.2  12.1    NBA   10.810811  25.0   NaN
2015-14   8.1   4.3  23.1    NBA   53.086420  80.0   NaN
2014-13   5.4  11.1  15.6    NBA  205.555556  35.0   NaN
2013-12   6.2   3.7  25.5    NBA   59.677419  70.0   NaN
2012-11   4.7   8.5  32.0    NBA  180.851064  70.0   NaN
2017-16   NaN   NaN   NaN    NBA    0.000000   NaN  Jazz